<?xml version="1.0" ?>
<net name="deblurgan-v2" version="10">
	<layers>
		<layer id="0" name="blur_image" type="Parameter" version="opset1">
			<data shape="1, 3, 736, 1312" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="blur_image">
					<dim>1</dim>
					<dim>3</dim>
					<dim>736</dim>
					<dim>1312</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="1934" type="Const" version="opset1">
			<data element_type="f32" shape="1, 160, 1, 1" offset="0" size="640"/>
			<output>
				<port id="0" precision="FP32" names="1934">
					<dim>1</dim>
					<dim>160</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="1929" type="Const" version="opset1">
			<data element_type="f32" shape="1, 576, 1, 1" offset="640" size="2304"/>
			<output>
				<port id="0" precision="FP32" names="1929">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="1924" type="Const" version="opset1">
			<data element_type="f32" shape="1, 576, 1, 1" offset="2944" size="2304"/>
			<output>
				<port id="0" precision="FP32" names="1924">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="1889" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="5248" size="384"/>
			<output>
				<port id="0" precision="FP32" names="1889">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="1884" type="Const" version="opset1">
			<data element_type="f32" shape="1, 384, 1, 1" offset="5632" size="1536"/>
			<output>
				<port id="0" precision="FP32" names="1884">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="1879" type="Const" version="opset1">
			<data element_type="f32" shape="1, 384, 1, 1" offset="7168" size="1536"/>
			<output>
				<port id="0" precision="FP32" names="1879">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="1829" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="8704" size="256"/>
			<output>
				<port id="0" precision="FP32" names="1829">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="1824" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="8960" size="768"/>
			<output>
				<port id="0" precision="FP32" names="1824">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="1819" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="9728" size="768"/>
			<output>
				<port id="0" precision="FP32" names="1819">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="1784" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="10496" size="128"/>
			<output>
				<port id="0" precision="FP32" names="1784">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="1779" type="Const" version="opset1">
			<data element_type="f32" shape="1, 144, 1, 1" offset="10624" size="576"/>
			<output>
				<port id="0" precision="FP32" names="1779">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="1774" type="Const" version="opset1">
			<data element_type="f32" shape="1, 144, 1, 1" offset="11200" size="576"/>
			<output>
				<port id="0" precision="FP32" names="1774">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="1754" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="11776" size="96"/>
			<output>
				<port id="0" precision="FP32" names="1754">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="1749" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="11872" size="384"/>
			<output>
				<port id="0" precision="FP32" names="1749">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="1744" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="12256" size="384"/>
			<output>
				<port id="0" precision="FP32" names="1744">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="1739" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="12640" size="64"/>
			<output>
				<port id="0" precision="FP32" names="1739">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="1734" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="12704" size="128"/>
			<output>
				<port id="0" precision="FP32" names="1734">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="1729" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="12832" size="128"/>
			<output>
				<port id="0" precision="FP32" names="1729">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="blur_image/reverse_input_channels6240262404/Split_input_port_1/value6240869602" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="12960" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="20" name="blur_image/reverse_input_channels6240262404/Split" type="Split" version="opset1">
			<data num_splits="3"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>736</dim>
					<dim>1312</dim>
				</port>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>736</dim>
					<dim>1312</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>736</dim>
					<dim>1312</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>736</dim>
					<dim>1312</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="blur_image/reverse_input_channels6240262404/Concat" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>736</dim>
					<dim>1312</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>736</dim>
					<dim>1312</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>736</dim>
					<dim>1312</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>736</dim>
					<dim>1312</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="data_mul_2676370796" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="12968" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="blur_image/scale/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>736</dim>
					<dim>1312</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>736</dim>
					<dim>1312</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="data_add_2676571078" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="12972" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="blur_image/mean/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>736</dim>
					<dim>1312</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>736</dim>
					<dim>1312</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="impl.module.fpn.features.0.0.weight" type="Const" version="opset1">
			<data element_type="f32" shape="32, 3, 3, 3" offset="12976" size="3456"/>
			<output>
				<port id="0" precision="FP32" names="impl.module.fpn.features.0.0.weight">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Conv_0" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>736</dim>
					<dim>1312</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="197">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="ReduceMean_1/axis" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="16432" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="ReduceMean_1" type="ReduceMean" version="opset1">
			<data keep_dims="false"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="198">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Unsqueeze_17/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="12960" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Unsqueeze_17/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="218">
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Unsqueeze_18/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="16456" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Unsqueeze_18/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Sub_19/neg_/Negate" type="Negative" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Sub_19/neg_/EltwiseUnsqueeze_input_port_1/value2916670574" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="16464" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Sub_19/neg_/EltwiseUnsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="219">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Sub_19" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="220">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Mul_20" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="221">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="ReduceMean_2/axis" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="16432" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="ReduceMean_2" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Sub_3/sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="200">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Mul_4" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="201">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="ReduceMean_5/axis" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="16432" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="ReduceMean_5" type="ReduceMean" version="opset1">
			<data keep_dims="false"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="1557" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="16472" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Sqrt_6/pow_" type="Power" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="203">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="1727" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="16476" size="4"/>
			<output>
				<port id="0" precision="FP32" names="1727">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Pow_7" type="Power" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="206">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Unsqueeze_8/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="12960" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Unsqueeze_8/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="207">
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Unsqueeze_9/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="16456" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Unsqueeze_9/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="208">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Constant_10" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="16480" size="4"/>
			<output>
				<port id="0" precision="FP32" names="209">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Add_11" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="1738" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="16472" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Sqrt_12/pow_" type="Power" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Div_14/reciprocal__input_port_1/value23925" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="12972" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Div_14/reciprocal_" type="Power" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Div_14/reciprocal_/EltwiseUnsqueeze_input_port_1/value2771069272" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="16464" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Div_14/reciprocal_/EltwiseUnsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="211,215">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Mul_21" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="222">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="1731" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="16484" size="128"/>
			<output>
				<port id="0" precision="FP32" names="1731">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Add_22" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="225">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Clip_25" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="228">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="impl.module.fpn.features.1.conv.0.weight" type="Const" version="opset1">
			<data element_type="f32" shape="32, 1, 1, 3, 3" offset="16612" size="1152"/>
			<output>
				<port id="0" precision="FP32" names="impl.module.fpn.features.1.conv.0.weight">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Conv_26" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="229">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="ReduceMean_27/axis" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="16432" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="ReduceMean_27" type="ReduceMean" version="opset1">
			<data keep_dims="false"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="230">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Unsqueeze_43/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="12960" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Unsqueeze_43/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="250">
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Unsqueeze_44/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="16456" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Unsqueeze_44/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Sub_45/neg_/Negate" type="Negative" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Sub_45/neg_/EltwiseUnsqueeze_input_port_1/value2917871405" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="16464" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Sub_45/neg_/EltwiseUnsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="251">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Sub_45" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="252">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Mul_46" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="253">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="ReduceMean_28/axis" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="16432" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="ReduceMean_28" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Sub_29/sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="232">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Mul_30" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="233">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="ReduceMean_31/axis" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="16432" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="ReduceMean_31" type="ReduceMean" version="opset1">
			<data keep_dims="false"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="1589" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="16472" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Sqrt_32/pow_" type="Power" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="235">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="1732" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="16476" size="4"/>
			<output>
				<port id="0" precision="FP32" names="1732">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Pow_33" type="Power" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="238">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Unsqueeze_34/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="12960" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Unsqueeze_34/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="239">
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Unsqueeze_35/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="16456" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Unsqueeze_35/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="240">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_36" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="16480" size="4"/>
			<output>
				<port id="0" precision="FP32" names="241">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Add_37" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="1625" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="16472" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Sqrt_38/pow_" type="Power" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Div_40/reciprocal__input_port_1/value23931" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="12972" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Div_40/reciprocal_" type="Power" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Div_40/reciprocal_/EltwiseUnsqueeze_input_port_1/value2773070703" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="16464" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Div_40/reciprocal_/EltwiseUnsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="243,247">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Mul_47" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="254">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="1736" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="17764" size="128"/>
			<output>
				<port id="0" precision="FP32" names="1736">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Add_48" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="257">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Clip_51" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="260">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="impl.module.fpn.features.1.conv.3.weight" type="Const" version="opset1">
			<data element_type="f32" shape="16, 32, 1, 1" offset="17892" size="2048"/>
			<output>
				<port id="0" precision="FP32" names="impl.module.fpn.features.1.conv.3.weight">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Conv_52" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="261">
					<dim>1</dim>
					<dim>16</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="ReduceMean_53/axis" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="16432" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="ReduceMean_53" type="ReduceMean" version="opset1">
			<data keep_dims="false"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="262">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Unsqueeze_69/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="12960" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Unsqueeze_69/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="282">
					<dim>16</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Unsqueeze_70/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="16456" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Unsqueeze_70/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Sub_71/neg_/Negate" type="Negative" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Sub_71/neg_/EltwiseUnsqueeze_input_port_1/value2919069038" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="16464" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Sub_71/neg_/EltwiseUnsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="283">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Sub_71" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="284">
					<dim>1</dim>
					<dim>16</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Mul_72" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="285">
					<dim>1</dim>
					<dim>16</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="ReduceMean_54/axis" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="16432" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="ReduceMean_54" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Sub_55/sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="264">
					<dim>1</dim>
					<dim>16</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Mul_56" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="265">
					<dim>1</dim>
					<dim>16</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="ReduceMean_57/axis" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="16432" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="ReduceMean_57" type="ReduceMean" version="opset1">
			<data keep_dims="false"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>368</dim>
					<dim>656</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="1740" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="16472" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="Sqrt_58/pow_" type="Power" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="267">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="1737" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="16476" size="4"/>
			<output>
				<port id="0" precision="FP32" names="1737">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="Pow_59" type="Power" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="270">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="Unsqueeze_60/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="12960" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="Unsqueeze_60/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="271">
					<dim>16</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="Unsqueeze_61/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="16456" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="Unsqueeze_61/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="272">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="Constant_62" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="16480" size="4"/>
			<output>
				<port id="0" precision="FP32" names="273">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="Add_63" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="1611" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="16472" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="Sqrt_64/pow_" type="Power" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
