<?xml version="1.0" ?>
<net name="deeplabv3" version="11">
	<layers>
		<layer id="0" name="mul_1/placeholder_port_1" type="Parameter" version="opset1">
			<data shape="1,513,513,3" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="mul_1/placeholder_port_1"/>
				<attribute name="old_api_map_element_type" version="0" value="f16"/>
				<attribute name="old_api_map_order" version="0" value="0, 2, 3, 1"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="1:mul_1">
					<dim>1</dim>
					<dim>513</dim>
					<dim>513</dim>
					<dim>3</dim>
					<rt_info>
						<attribute name="layout" version="0" layout="[N,H,W,C]"/>
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="1" name="mul_1/x_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="0" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="mul_1/x" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="mul_1/x"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="mul_1/x:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="mul_1/placeholder_port_1/Transpose([0 3 1 2])/value1924824542" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="2" size="32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="mul_1/placeholder_port_1/Transpose([0 3 1 2])/value1924824542"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="mul_1/placeholder_port_1/Transpose([0 3 1 2])" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="mul_1/placeholder_port_1/Transpose([0 3 1 2])"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>513</dim>
					<dim>513</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>513</dim>
					<dim>513</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="mul_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="mul_1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>513</dim>
					<dim>513</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="mul_1:0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>513</dim>
					<dim>513</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="sub_7/y_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="34" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="sub_7/y" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="sub_7/y"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="sub_7/y:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="sub_7" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="sub_7"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>513</dim>
					<dim>513</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sub_7:0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>513</dim>
					<dim>513</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="MobilenetV2/Conv/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 3, 3, 3" offset="36" size="1728"/>
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="MobilenetV2/Conv/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="MobilenetV2/Conv/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="MobilenetV2/Conv/weights/read:0">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="MobilenetV2/Conv/Conv2D" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MobilenetV2/Conv/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>513</dim>
					<dim>513</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>257</dim>
					<dim>257</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="data_add_15168_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="1764" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="data_add_15168" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="data_add_15168"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="MobilenetV2/Conv/BatchNorm/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MobilenetV2/Conv/BatchNorm/FusedBatchNorm/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>257</dim>
					<dim>257</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="MobilenetV2/Conv/BatchNorm/FusedBatchNorm:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>257</dim>
					<dim>257</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="MobilenetV2/Conv/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MobilenetV2/Conv/Relu6"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>257</dim>
					<dim>257</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="MobilenetV2/Conv/Relu6:0,MobilenetV2/expanded_conv/input:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>257</dim>
					<dim>257</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="MobilenetV2/expanded_conv/depthwise/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 1, 1, 3, 3" offset="1828" size="576"/>
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="MobilenetV2/expanded_conv/depthwise/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="MobilenetV2/expanded_conv/depthwise/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="MobilenetV2/expanded_conv/depthwise/depthwise_weights/read:0">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="MobilenetV2/expanded_conv/depthwise/depthwise" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="0, 0" pads_end="0, 0" dilations="1, 1" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MobilenetV2/expanded_conv/depthwise/depthwise"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>257</dim>
					<dim>257</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>257</dim>
					<dim>257</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="data_add_1517115176_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="2404" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="data_add_1517115176" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="data_add_1517115176"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="MobilenetV2/expanded_conv/depthwise/BatchNorm/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MobilenetV2/expanded_conv/depthwise/BatchNorm/FusedBatchNorm/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>257</dim>
					<dim>257</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="MobilenetV2/expanded_conv/depthwise/BatchNorm/FusedBatchNorm:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>257</dim>
					<dim>257</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="MobilenetV2/expanded_conv/depthwise/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MobilenetV2/expanded_conv/depthwise/Relu6"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>257</dim>
					<dim>257</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="MobilenetV2/expanded_conv/depthwise/Relu6:0,MobilenetV2/expanded_conv/depthwise_output:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>257</dim>
					<dim>257</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="MobilenetV2/expanded_conv/project/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 32, 1, 1" offset="2468" size="1024"/>
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="MobilenetV2/expanded_conv/project/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="MobilenetV2/expanded_conv/project/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="MobilenetV2/expanded_conv/project/weights/read:0">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="MobilenetV2/expanded_conv/project/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MobilenetV2/expanded_conv/project/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>257</dim>
					<dim>257</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>257</dim>
					<dim>257</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="data_add_1517915184_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="3492" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="data_add_1517915184" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="data_add_1517915184"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="MobilenetV2/expanded_conv/project/BatchNorm/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MobilenetV2/expanded_conv/project/BatchNorm/FusedBatchNorm/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>257</dim>
					<dim>257</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="MobilenetV2/expanded_conv/output:0,MobilenetV2/expanded_conv/project/BatchNorm/FusedBatchNorm:0,MobilenetV2/expanded_conv/project/Identity:0,MobilenetV2/expanded_conv_1/input:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>257</dim>
					<dim>257</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="MobilenetV2/expanded_conv_1/expand/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="96, 16, 1, 1" offset="3524" size="3072"/>
			<output>
				<port id="0" precision="FP16">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="MobilenetV2/expanded_conv_1/expand/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="MobilenetV2/expanded_conv_1/expand/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="MobilenetV2/expanded_conv_1/expand/weights/read:0">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="MobilenetV2/expanded_conv_1/expand/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MobilenetV2/expanded_conv_1/expand/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>257</dim>
					<dim>257</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>257</dim>
					<dim>257</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="data_add_1518715192_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 96, 1, 1" offset="6596" size="192"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="data_add_1518715192" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="data_add_1518715192"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="MobilenetV2/expanded_conv_1/expand/BatchNorm/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MobilenetV2/expanded_conv_1/expand/BatchNorm/FusedBatchNorm/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>257</dim>
					<dim>257</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="MobilenetV2/expanded_conv_1/expand/BatchNorm/FusedBatchNorm:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>257</dim>
					<dim>257</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="MobilenetV2/expanded_conv_1/expand/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MobilenetV2/expanded_conv_1/expand/Relu6"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>257</dim>
					<dim>257</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="MobilenetV2/expanded_conv_1/expand/Relu6:0,MobilenetV2/expanded_conv_1/expansion_output:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>257</dim>
					<dim>257</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="MobilenetV2/expanded_conv_1/depthwise/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="96, 1, 1, 3, 3" offset="6788" size="1728"/>
			<output>
				<port id="0" precision="FP16">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="MobilenetV2/expanded_conv_1/depthwise/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="MobilenetV2/expanded_conv_1/depthwise/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="MobilenetV2/expanded_conv_1/depthwise/depthwise_weights/read:0">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="MobilenetV2/expanded_conv_1/depthwise/depthwise" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="0, 0" dilations="1, 1" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MobilenetV2/expanded_conv_1/depthwise/depthwise"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>257</dim>
					<dim>257</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="data_add_1519515200_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 96, 1, 1" offset="8516" size="192"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="data_add_1519515200" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="data_add_1519515200"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="MobilenetV2/expanded_conv_1/depthwise/BatchNorm/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MobilenetV2/expanded_conv_1/depthwise/BatchNorm/FusedBatchNorm/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="MobilenetV2/expanded_conv_1/depthwise/BatchNorm/FusedBatchNorm:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="MobilenetV2/expanded_conv_1/depthwise/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MobilenetV2/expanded_conv_1/depthwise/Relu6"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="MobilenetV2/expanded_conv_1/depthwise/Relu6:0,MobilenetV2/expanded_conv_1/depthwise_output:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="MobilenetV2/expanded_conv_1/project/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="24, 96, 1, 1" offset="8708" size="4608"/>
			<output>
				<port id="0" precision="FP16">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="MobilenetV2/expanded_conv_1/project/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="MobilenetV2/expanded_conv_1/project/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="MobilenetV2/expanded_conv_1/project/weights/read:0">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="MobilenetV2/expanded_conv_1/project/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MobilenetV2/expanded_conv_1/project/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="data_add_1520315208_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 24, 1, 1" offset="13316" size="48"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="data_add_1520315208" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="data_add_1520315208"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="MobilenetV2/expanded_conv_1/project/BatchNorm/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MobilenetV2/expanded_conv_1/project/BatchNorm/FusedBatchNorm/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="MobilenetV2/expanded_conv_1/output:0,MobilenetV2/expanded_conv_1/project/BatchNorm/FusedBatchNorm:0,MobilenetV2/expanded_conv_1/project/Identity:0,MobilenetV2/expanded_conv_2/input:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="MobilenetV2/expanded_conv_2/expand/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="144, 24, 1, 1" offset="13364" size="6912"/>
			<output>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="MobilenetV2/expanded_conv_2/expand/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="MobilenetV2/expanded_conv_2/expand/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="MobilenetV2/expanded_conv_2/expand/weights/read:0">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="MobilenetV2/expanded_conv_2/expand/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MobilenetV2/expanded_conv_2/expand/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="data_add_1521115216_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 144, 1, 1" offset="20276" size="288"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="data_add_1521115216" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="data_add_1521115216"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="MobilenetV2/expanded_conv_2/expand/BatchNorm/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MobilenetV2/expanded_conv_2/expand/BatchNorm/FusedBatchNorm/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="MobilenetV2/expanded_conv_2/expand/BatchNorm/FusedBatchNorm:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="MobilenetV2/expanded_conv_2/expand/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MobilenetV2/expanded_conv_2/expand/Relu6"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="MobilenetV2/expanded_conv_2/expand/Relu6:0,MobilenetV2/expanded_conv_2/expansion_output:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="MobilenetV2/expanded_conv_2/depthwise/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="144, 1, 1, 3, 3" offset="20564" size="2592"/>
			<output>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="MobilenetV2/expanded_conv_2/depthwise/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="MobilenetV2/expanded_conv_2/depthwise/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="MobilenetV2/expanded_conv_2/depthwise/depthwise_weights/read:0">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="MobilenetV2/expanded_conv_2/depthwise/depthwise" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="0, 0" pads_end="0, 0" dilations="1, 1" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MobilenetV2/expanded_conv_2/depthwise/depthwise"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="data_add_1521915224_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 144, 1, 1" offset="23156" size="288"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="data_add_1521915224" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="data_add_1521915224"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="MobilenetV2/expanded_conv_2/depthwise/BatchNorm/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MobilenetV2/expanded_conv_2/depthwise/BatchNorm/FusedBatchNorm/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="MobilenetV2/expanded_conv_2/depthwise/BatchNorm/FusedBatchNorm:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="MobilenetV2/expanded_conv_2/depthwise/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MobilenetV2/expanded_conv_2/depthwise/Relu6"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="MobilenetV2/expanded_conv_2/depthwise/Relu6:0,MobilenetV2/expanded_conv_2/depthwise_output:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="MobilenetV2/expanded_conv_2/project/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="24, 144, 1, 1" offset="23444" size="6912"/>
			<output>
				<port id="0" precision="FP16">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="MobilenetV2/expanded_conv_2/project/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="MobilenetV2/expanded_conv_2/project/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="MobilenetV2/expanded_conv_2/project/weights/read:0">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="MobilenetV2/expanded_conv_2/project/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MobilenetV2/expanded_conv_2/project/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="data_add_1522715232_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 24, 1, 1" offset="30356" size="48"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="data_add_1522715232" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="data_add_1522715232"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="MobilenetV2/expanded_conv_2/project/BatchNorm/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MobilenetV2/expanded_conv_2/project/BatchNorm/FusedBatchNorm/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="MobilenetV2/expanded_conv_2/project/BatchNorm/FusedBatchNorm:0,MobilenetV2/expanded_conv_2/project/Identity:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="MobilenetV2/expanded_conv_2/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MobilenetV2/expanded_conv_2/add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="MobilenetV2/expanded_conv_2/add:0,MobilenetV2/expanded_conv_2/output:0,MobilenetV2/expanded_conv_3/input:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="MobilenetV2/expanded_conv_3/expand/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="144, 24, 1, 1" offset="30404" size="6912"/>
			<output>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="MobilenetV2/expanded_conv_3/expand/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="MobilenetV2/expanded_conv_3/expand/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="MobilenetV2/expanded_conv_3/expand/weights/read:0">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="MobilenetV2/expanded_conv_3/expand/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MobilenetV2/expanded_conv_3/expand/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="data_add_1523515240_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 144, 1, 1" offset="37316" size="288"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="data_add_1523515240" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="data_add_1523515240"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="MobilenetV2/expanded_conv_3/expand/BatchNorm/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MobilenetV2/expanded_conv_3/expand/BatchNorm/FusedBatchNorm/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="MobilenetV2/expanded_conv_3/expand/BatchNorm/FusedBatchNorm:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="MobilenetV2/expanded_conv_3/expand/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MobilenetV2/expanded_conv_3/expand/Relu6"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="MobilenetV2/expanded_conv_3/expand/Relu6:0,MobilenetV2/expanded_conv_3/expansion_output:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="MobilenetV2/expanded_conv_3/depthwise/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="144, 1, 1, 3, 3" offset="37604" size="2592"/>
			<output>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="MobilenetV2/expanded_conv_3/depthwise/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="MobilenetV2/expanded_conv_3/depthwise/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="MobilenetV2/expanded_conv_3/depthwise/depthwise_weights/read:0">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="MobilenetV2/expanded_conv_3/depthwise/depthwise" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="0, 0" dilations="1, 1" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MobilenetV2/expanded_conv_3/depthwise/depthwise"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>65</dim>
					<dim>65</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="data_add_1524315248_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 144, 1, 1" offset="40196" size="288"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="data_add_1524315248" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="data_add_1524315248"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="MobilenetV2/expanded_conv_3/depthwise/BatchNorm/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MobilenetV2/expanded_conv_3/depthwise/BatchNorm/FusedBatchNorm/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>65</dim>
					<dim>65</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="MobilenetV2/expanded_conv_3/depthwise/BatchNorm/FusedBatchNorm:0">
					<dim>1</dim>
